{"weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 32], "name": "Conv1/kernel"}, {"dtype": "float32", "shape": [1, 1, 320, 1280], "name": "Conv_1/kernel"}, {"dtype": "float32", "shape": [1280], "name": "Conv_1_bn/gamma"}, {"dtype": "float32", "shape": [1280], "name": "Conv_1_bn/beta"}, {"dtype": "float32", "shape": [1280], "name": "Conv_1_bn/moving_mean"}, {"dtype": "float32", "shape": [1280], "name": "Conv_1_bn/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "block_10_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [384], "name": "block_10_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_10_depthwise_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_10_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_10_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "block_10_expand/kernel"}, {"dtype": "float32", "shape": [384], "name": "block_10_expand_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_10_expand_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_10_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_10_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 384, 96], "name": "block_10_project/kernel"}, {"dtype": "float32", "shape": [96], "name": "block_10_project_BN/gamma"}, {"dtype": "float32", "shape": [96], "name": "block_10_project_BN/beta"}, {"dtype": "float32", "shape": [96], "name": "block_10_project_BN/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "block_10_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "block_11_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [576], "name": "block_11_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_11_depthwise_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_11_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_11_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "block_11_expand/kernel"}, {"dtype": "float32", "shape": [576], "name": "block_11_expand_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_11_expand_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_11_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_11_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 576, 96], "name": "block_11_project/kernel"}, {"dtype": "float32", "shape": [96], "name": "block_11_project_BN/gamma"}, {"dtype": "float32", "shape": [96], "name": "block_11_project_BN/beta"}, {"dtype": "float32", "shape": [96], "name": "block_11_project_BN/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "block_11_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "block_12_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [576], "name": "block_12_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_12_depthwise_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_12_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_12_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "block_12_expand/kernel"}, {"dtype": "float32", "shape": [576], "name": "block_12_expand_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_12_expand_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_12_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_12_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 576, 96], "name": "block_12_project/kernel"}, {"dtype": "float32", "shape": [96], "name": "block_12_project_BN/gamma"}, {"dtype": "float32", "shape": [96], "name": "block_12_project_BN/beta"}, {"dtype": "float32", "shape": [96], "name": "block_12_project_BN/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "block_12_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 576, 1], "name": "block_13_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [576], "name": "block_13_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_13_depthwise_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_13_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_13_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 96, 576], "name": "block_13_expand/kernel"}, {"dtype": "float32", "shape": [576], "name": "block_13_expand_BN/gamma"}, {"dtype": "float32", "shape": [576], "name": "block_13_expand_BN/beta"}, {"dtype": "float32", "shape": [576], "name": "block_13_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [576], "name": "block_13_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 576, 160], "name": "block_13_project/kernel"}, {"dtype": "float32", "shape": [160], "name": "block_13_project_BN/gamma"}, {"dtype": "float32", "shape": [160], "name": "block_13_project_BN/beta"}, {"dtype": "float32", "shape": [160], "name": "block_13_project_BN/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "block_13_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "block_14_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [960], "name": "block_14_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_14_depthwise_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_14_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_14_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "block_14_expand/kernel"}, {"dtype": "float32", "shape": [960], "name": "block_14_expand_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_14_expand_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_14_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_14_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 960, 160], "name": "block_14_project/kernel"}, {"dtype": "float32", "shape": [160], "name": "block_14_project_BN/gamma"}, {"dtype": "float32", "shape": [160], "name": "block_14_project_BN/beta"}, {"dtype": "float32", "shape": [160], "name": "block_14_project_BN/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "block_14_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "block_15_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [960], "name": "block_15_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_15_depthwise_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_15_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_15_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "block_15_expand/kernel"}, {"dtype": "float32", "shape": [960], "name": "block_15_expand_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_15_expand_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_15_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_15_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 960, 160], "name": "block_15_project/kernel"}, {"dtype": "float32", "shape": [160], "name": "block_15_project_BN/gamma"}, {"dtype": "float32", "shape": [160], "name": "block_15_project_BN/beta"}, {"dtype": "float32", "shape": [160], "name": "block_15_project_BN/moving_mean"}, {"dtype": "float32", "shape": [160], "name": "block_15_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 960, 1], "name": "block_16_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [960], "name": "block_16_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_16_depthwise_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_16_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_16_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 160, 960], "name": "block_16_expand/kernel"}, {"dtype": "float32", "shape": [960], "name": "block_16_expand_BN/gamma"}, {"dtype": "float32", "shape": [960], "name": "block_16_expand_BN/beta"}, {"dtype": "float32", "shape": [960], "name": "block_16_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [960], "name": "block_16_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 960, 320], "name": "block_16_project/kernel"}, {"dtype": "float32", "shape": [320], "name": "block_16_project_BN/gamma"}, {"dtype": "float32", "shape": [320], "name": "block_16_project_BN/beta"}, {"dtype": "float32", "shape": [320], "name": "block_16_project_BN/moving_mean"}, {"dtype": "float32", "shape": [320], "name": "block_16_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 96, 1], "name": "block_1_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [96], "name": "block_1_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [96], "name": "block_1_depthwise_BN/beta"}, {"dtype": "float32", "shape": [96], "name": "block_1_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "block_1_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 16, 96], "name": "block_1_expand/kernel"}, {"dtype": "float32", "shape": [96], "name": "block_1_expand_BN/gamma"}, {"dtype": "float32", "shape": [96], "name": "block_1_expand_BN/beta"}, {"dtype": "float32", "shape": [96], "name": "block_1_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [96], "name": "block_1_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 96, 24], "name": "block_1_project/kernel"}, {"dtype": "float32", "shape": [24], "name": "block_1_project_BN/gamma"}, {"dtype": "float32", "shape": [24], "name": "block_1_project_BN/beta"}, {"dtype": "float32", "shape": [24], "name": "block_1_project_BN/moving_mean"}, {"dtype": "float32", "shape": [24], "name": "block_1_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 144, 1], "name": "block_2_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [144], "name": "block_2_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [144], "name": "block_2_depthwise_BN/beta"}, {"dtype": "float32", "shape": [144], "name": "block_2_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [144], "name": "block_2_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 24, 144], "name": "block_2_expand/kernel"}, {"dtype": "float32", "shape": [144], "name": "block_2_expand_BN/gamma"}, {"dtype": "float32", "shape": [144], "name": "block_2_expand_BN/beta"}, {"dtype": "float32", "shape": [144], "name": "block_2_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [144], "name": "block_2_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 144, 24], "name": "block_2_project/kernel"}, {"dtype": "float32", "shape": [24], "name": "block_2_project_BN/gamma"}, {"dtype": "float32", "shape": [24], "name": "block_2_project_BN/beta"}, {"dtype": "float32", "shape": [24], "name": "block_2_project_BN/moving_mean"}, {"dtype": "float32", "shape": [24], "name": "block_2_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 144, 1], "name": "block_3_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [144], "name": "block_3_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [144], "name": "block_3_depthwise_BN/beta"}, {"dtype": "float32", "shape": [144], "name": "block_3_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [144], "name": "block_3_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 24, 144], "name": "block_3_expand/kernel"}, {"dtype": "float32", "shape": [144], "name": "block_3_expand_BN/gamma"}, {"dtype": "float32", "shape": [144], "name": "block_3_expand_BN/beta"}, {"dtype": "float32", "shape": [144], "name": "block_3_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [144], "name": "block_3_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 144, 32], "name": "block_3_project/kernel"}, {"dtype": "float32", "shape": [32], "name": "block_3_project_BN/gamma"}, {"dtype": "float32", "shape": [32], "name": "block_3_project_BN/beta"}, {"dtype": "float32", "shape": [32], "name": "block_3_project_BN/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "block_3_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "block_4_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [192], "name": "block_4_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_4_depthwise_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_4_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_4_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "block_4_expand/kernel"}, {"dtype": "float32", "shape": [192], "name": "block_4_expand_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_4_expand_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_4_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_4_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 192, 32], "name": "block_4_project/kernel"}, {"dtype": "float32", "shape": [32], "name": "block_4_project_BN/gamma"}, {"dtype": "float32", "shape": [32], "name": "block_4_project_BN/beta"}, {"dtype": "float32", "shape": [32], "name": "block_4_project_BN/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "block_4_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "block_5_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [192], "name": "block_5_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_5_depthwise_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_5_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_5_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "block_5_expand/kernel"}, {"dtype": "float32", "shape": [192], "name": "block_5_expand_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_5_expand_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_5_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_5_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 192, 32], "name": "block_5_project/kernel"}, {"dtype": "float32", "shape": [32], "name": "block_5_project_BN/gamma"}, {"dtype": "float32", "shape": [32], "name": "block_5_project_BN/beta"}, {"dtype": "float32", "shape": [32], "name": "block_5_project_BN/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "block_5_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 192, 1], "name": "block_6_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [192], "name": "block_6_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_6_depthwise_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_6_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_6_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 192], "name": "block_6_expand/kernel"}, {"dtype": "float32", "shape": [192], "name": "block_6_expand_BN/gamma"}, {"dtype": "float32", "shape": [192], "name": "block_6_expand_BN/beta"}, {"dtype": "float32", "shape": [192], "name": "block_6_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [192], "name": "block_6_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "block_6_project/kernel"}, {"dtype": "float32", "shape": [64], "name": "block_6_project_BN/gamma"}, {"dtype": "float32", "shape": [64], "name": "block_6_project_BN/beta"}, {"dtype": "float32", "shape": [64], "name": "block_6_project_BN/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "block_6_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "block_7_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [384], "name": "block_7_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_7_depthwise_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_7_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_7_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "block_7_expand/kernel"}, {"dtype": "float32", "shape": [384], "name": "block_7_expand_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_7_expand_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_7_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_7_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "block_7_project/kernel"}, {"dtype": "float32", "shape": [64], "name": "block_7_project_BN/gamma"}, {"dtype": "float32", "shape": [64], "name": "block_7_project_BN/beta"}, {"dtype": "float32", "shape": [64], "name": "block_7_project_BN/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "block_7_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "block_8_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [384], "name": "block_8_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_8_depthwise_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_8_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_8_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "block_8_expand/kernel"}, {"dtype": "float32", "shape": [384], "name": "block_8_expand_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_8_expand_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_8_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_8_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "block_8_project/kernel"}, {"dtype": "float32", "shape": [64], "name": "block_8_project_BN/gamma"}, {"dtype": "float32", "shape": [64], "name": "block_8_project_BN/beta"}, {"dtype": "float32", "shape": [64], "name": "block_8_project_BN/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "block_8_project_BN/moving_variance"}, {"dtype": "float32", "shape": [3, 3, 384, 1], "name": "block_9_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [384], "name": "block_9_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_9_depthwise_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_9_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_9_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 64, 384], "name": "block_9_expand/kernel"}, {"dtype": "float32", "shape": [384], "name": "block_9_expand_BN/gamma"}, {"dtype": "float32", "shape": [384], "name": "block_9_expand_BN/beta"}, {"dtype": "float32", "shape": [384], "name": "block_9_expand_BN/moving_mean"}, {"dtype": "float32", "shape": [384], "name": "block_9_expand_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 384, 64], "name": "block_9_project/kernel"}, {"dtype": "float32", "shape": [64], "name": "block_9_project_BN/gamma"}, {"dtype": "float32", "shape": [64], "name": "block_9_project_BN/beta"}, {"dtype": "float32", "shape": [64], "name": "block_9_project_BN/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "block_9_project_BN/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "bn_Conv1/gamma"}, {"dtype": "float32", "shape": [32], "name": "bn_Conv1/beta"}, {"dtype": "float32", "shape": [32], "name": "bn_Conv1/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "bn_Conv1/moving_variance"}, {"dtype": "float32", "shape": [1280, 1024], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [1024], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [1024, 1024], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1024], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [1024, 512], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [512, 2], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "expanded_conv_depthwise/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "expanded_conv_depthwise_BN/gamma"}, {"dtype": "float32", "shape": [32], "name": "expanded_conv_depthwise_BN/beta"}, {"dtype": "float32", "shape": [32], "name": "expanded_conv_depthwise_BN/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "expanded_conv_depthwise_BN/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "name": "expanded_conv_project/kernel"}, {"dtype": "float32", "shape": [16], "name": "expanded_conv_project_BN/gamma"}, {"dtype": "float32", "shape": [16], "name": "expanded_conv_project_BN/beta"}, {"dtype": "float32", "shape": [16], "name": "expanded_conv_project_BN/moving_mean"}, {"dtype": "float32", "shape": [16], "name": "expanded_conv_project_BN/moving_variance"}]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.5", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": false, "name": "Conv1_pad", "data_format": "channels_last"}, "name": "Conv1_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "Conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_Conv1", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "bn_Conv1"}, {"class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "config": {"name": "Conv1_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "Conv1_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "expanded_conv_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "expanded_conv_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "expanded_conv_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "config": {"name": "expanded_conv_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "expanded_conv_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "expanded_conv_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "expanded_conv_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_project_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "expanded_conv_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_expand", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_1_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_expand_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "config": {"name": "block_1_expand_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_1_expand_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": false, "name": "block_1_pad", "data_format": "channels_last"}, "name": "block_1_pad"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block_1_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_1_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "config": {"name": "block_1_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_1_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_1_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_project_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_expand", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_2_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_expand_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "config": {"name": "block_2_expand_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_2_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block_2_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_2_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "config": {"name": "block_2_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_2_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_2_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_project_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "name": "block_2_add"}, "name": "block_2_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_expand", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_3_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_expand_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "config": {"name": "block_3_expand_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_3_expand_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "dtype": "float32", "trainable": false, "name": "block_3_pad", "data_format": "channels_last"}, "name": "block_3_pad"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block_3_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_3_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "config": {"name": "block_3_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_3_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_3_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_project_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_expand", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_4_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_expand_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "config": {"name": "block_4_expand_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_4_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block_4_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_4_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "config": {"name": "block_4_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_4_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_4_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_project_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": false, "name": "block_4_add"}, "name": "block_4_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_expand", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_5_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_expand_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_5_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "config": {"name": "block_5_expand_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_5_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block_5_depthwise", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "depthwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_5_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "config": {"beta_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_depthwise_BN", "gamma_regularizer": null, "epsilon": 0.001, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_5_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "config": {"name": "block_5_depthwise_relu", "dtype": "float32", "trainable": false, "max_value": 6.0, "threshold": 0.0, "negative_slope": 0.0}, "name": "block_5_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_project", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_5_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], 